# Groupby function

## Groupby('<column_name>'): Have exactly 1 entry of each value, and execute a function on the values to get the same number of values

## 0) Setup

In [1]:
import pandas as pd

In [2]:
import matplotlib.pyplot as plt
import matplotlib
import os, sys

### 1) Create data

In [3]:
data = {'letter':['a','a','b','c','b','c'],'one':[1,1,1,1,1,1], 'two':[2,2,2,2,2,2] }

In [4]:
df = pd.DataFrame(data = data)

In [5]:
df

  letter  one  two
0      a    1    2
1      a    1    2
2      b    1    2
3      c    1    2
4      b    1    2
5      c    1    2

In [6]:
letter = df.groupby('letter')

In [7]:
letter

In [9]:
letter.sum()

        one  two
letter
a         2    4
b         2    4
c         2    4

In [14]:
letterone = df.groupby(['letter','one'] ).sum()

In [15]:
letterone

            two
letter one
a      1      4
b      1      4
c      1      4

In [16]:
df['two'] = [1,2,3,4,5,6]

In [17]:
df

  letter  one  two
0      a    1    1
1      a    1    2
2      b    1    3
3      c    1    4
4      b    1    5
5      c    1    6

In [18]:
df2 = df.groupby(['letter', 'two']).sum()

In [19]:
df2

            one
letter two
a      1      1
       2      1
b      3      1
       5      1
c      4      1
       6      1